DataProcessors/ТелефонныйСправочник.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ТелефонныйСправочник</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПривязкаТелефонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПривязкаТелефонов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Привязка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначенияИспользованияSIMКарт</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СлужебныеSIMКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОсновныеТелефоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОсновныеТелефоны</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СлужебныеSIMКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Привязка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначенияИспользованияSIMКарт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПользователиДляРассылки</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СлужебныеSIMКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СлужебныеSIMКарты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БезлимитПоРоумингу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляГолосовойСвязи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретСМСУведомлений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначенияИспользованияSIMКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОператорСвязи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифыМобильнойСвязи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельИспользования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиИспользования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Картинки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КраткоеИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВнесеныИзменения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расширение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеКЗаписи</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоОсновноеИзображение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ТелефонныйСправочник/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДобавитьНомер(Команда)
	
	ФормаНомера = ПолучитьФорму("Справочник.СлужебныеSIMКарты.ФормаОбъекта");
	ФормаНомера.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТелефоновВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	                                
	Если Элемент.ТекущиеДанные.Вид = "Служебный" Тогда
		СтруктураПараметров = Новый Структура("Ключ", Элемент.ТекущиеДанные.НомерЭлемент);
		ФормаСимКарты = ПолучитьФорму("Справочник.СлужебныеSIMКарты.ФормаОбъекта", СтруктураПараметров); 
		Если ФормаСимКарты.Открыта() Тогда
			ФормаСимКарты.Активизировать();
		Иначе
			ФормаСимКарты.Открыть();
		КонецЕсли;
	Иначе 
		СтруктураПараметров = Новый Структура("Ключ", Элемент.ТекущиеДанные.Объект);
		ФормаФизлица = ПолучитьФорму("Справочник.ФизическиеЛица.ФормаОбъекта", СтруктураПараметров);		
		Если ФормаФизлица.Открыта() Тогда
			ФормаФизлица.Активизировать();
		Иначе
			ФормаФизлица.Открыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СделатьОсновнымНаСервере(Данные)
	
	ТелефоннаяКнига.СделатьОсновным(Данные.НомерЭлемент, Данные.Назначение, Данные.Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура СделатьОсновным(Команда)
	
	ТекущиеДанные = Элементы.СписокТелефонов.ТекущиеДанные;
	Если ТекущиеДанные.Основной Тогда
		Сообщить("Это основной номер!");
		Возврат;
	КонецЕсли;

	//
	СделатьОсновнымНаСервере(ТекущиеДанные);

	Элементы.СписокТелефонов.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьКарту(Команда)
	
	ТекущиеДанные = Элементы.СписокТелефонов.ТекущиеДанные;
	Если ТекущиеДанные.Вид = "Личный" Тогда
		Сообщить("Это личный номер!");
		Возврат;
	КонецЕсли;
	
	//
	ФормаЗаписи = ПолучитьФорму("РегистрСведений.ПривязкаТелефонов.ФормаЗаписи");
	ФормаЗаписи.Запись.Номер 		= ТекущиеДанные.НомерЭлемент;
	ФормаЗаписи.Запись.Назначение 	= ТекущиеДанные.Назначение;
	ФормаЗаписи.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Позвонить(Команда)
	
	ТекДанные = Элементы.СписокТелефонов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	//
	АК_ТелефонияКлиент.Звонить(ТекДанные.НомерТелефона);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокТелефонов.ТекстЗапроса = Обработки.ТелефонныйСправочник.ПолучитьЗапросПоТелефонам();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭлементыОтбора = СписокТелефонов.Отбор.Элементы;
	Для каждого Элем из ЭлементыОтбора Цикл
		Если Элем.Представление = "Только основные телефоны" Тогда
			Этаформа.ТолькоОсновные 	= Элем.Использование;
		ИначеЕсли Элем.Представление = "Только голосовая связь" Тогда
			Этаформа.ТолькоГолосовая 	= Элем.Использование;
		ИначеЕсли Элем.Представление = "Абонент содержит" Тогда
			Этаформа.Абонент 			= Элем.ПравоеЗначение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Изменена привязка номера" Тогда  
		Элементы.СписокТелефонов.Обновить();		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТолькоОсновныеПриИзменении(Элемент)
	
	ЭлементыОтбора = СписокТелефонов.Отбор.Элементы;
	Для каждого Элем из ЭлементыОтбора Цикл
		Если Элем.Представление = "Только основные телефоны" Тогда
			Элем.Использование = Этаформа.ТолькоОсновные;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоГолосоваяПриИзменении(Элемент)
	
	ЭлементыОтбора = СписокТелефонов.Отбор.Элементы;
	Для каждого Элем из ЭлементыОтбора Цикл
		Если Элем.Представление = "Только голосовая связь" Тогда
			Элем.Использование = Этаформа.ТолькоГолосовая;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	
	ЭлементыОтбора = СписокТелефонов.Отбор.Элементы;
	Для каждого Элем из ЭлементыОтбора Цикл
		Если Элем.Представление = "Абонент содержит" Тогда
			Элем.ПравоеЗначение = Этаформа.Абонент;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ЭлементыОтбора = СписокТелефонов.Отбор.Элементы;
	Для каждого Элем из ЭлементыОтбора Цикл
		Если Элем.Представление = "Подразделение" Тогда
			Если ЗначениеЗаполнено(ЭтаФорма.Подразделение) Тогда
				Элем.ПравоеЗначение	= ЭтаФорма.Подразделение;
				Элем.Использование	= Истина;
			Иначе
				Элем.Использование	= Ложь;
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПривязкиПриИзменении(Элемент)
	
	ЭлементыОтбора = СписокТелефонов.Отбор.Элементы;
	Если ЭтаФорма.ВидПривязки = 1 Тогда
		Для каждого Элем из ЭлементыОтбора Цикл
			Если Элем.Представление = "Вид абонента" Тогда
				Элем.Использование	= Ложь;		
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для каждого Элем из ЭлементыОтбора Цикл
			Если Элем.Представление = "Вид абонента" Тогда
				Элем.Использование	= Истина;		
				Элем.ПравоеЗначение = ?(ЭтаФорма.ВидПривязки = 2, "Физлицо", "Подразделение");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;		

КонецПроцедуры


//+++AK BARA #16739
&НаКлиенте
Процедура ОтвязатьТелефон(Команда)
	
	ТекущиеДанные = Элементы.СписокТелефонов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено  Тогда 
		Номер 		= ТекущиеДанные.НомерЭлемент;		
		УдалитьПривязкиТелефона(Номер,ТекущиеДанные.НомерТелефона);	
		Элементы.СписокТелефонов.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьПривязкиТелефона(Номер,НомерТелефона)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОсновныеТелефоны.Привязка КАК Привязка,
	|	ОсновныеТелефоны.Назначение КАК Назначение,
	|	ОсновныеТелефоны.Телефон
	|ИЗ
	|	РегистрСведений.ОсновныеТелефоны КАК ОсновныеТелефоны
	|ГДЕ
	|	ОсновныеТелефоны.Телефон = &Телефон";
	
	Запрос.УстановитьПараметр("Телефон", Номер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		мзОсновныеТелефоны = РегистрыСведений.ОсновныеТелефоны.СоздатьМенеджерЗаписи();
		мзОсновныеТелефоны.Привязка = Выборка.Привязка  ;
		мзОсновныеТелефоны.Назначение = Выборка.Назначение  ;	
		мзОсновныеТелефоны.Прочитать();
		мзОсновныеТелефоны.Удалить();
	КонецЦикла;
	
	мзПЗ = РегистрыСведений.ПривязкаТелефонов.СоздатьМенеджерЗаписи();
	мзПЗ.Номер = Номер;
	мзПЗ.Период = ТекущаяДата();
	мзПЗ.Записать();
	
	Если ЗначениеЗаполнено(НомерТелефона) Тогда 
		ДлинаНомера = СтрДлина(НомерТелефона); 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект,
		|	КонтактнаяИнформация.Тип,
		|	КонтактнаяИнформация.Вид
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	(ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(11))) = &Представление
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)";
		
		Запрос.УстановитьПараметр("Представление", НомерТелефона);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			мзКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			мзКИ.Объект = Выборка.Объект;
			мзКИ.Тип = Выборка.Тип;
			мзКИ.Вид = Выборка.Вид;
			мзКИ.Прочитать();
			мзКИ.Удалить();
		КонецЦикла;
		
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СтруктурныеЕдиницы.Ссылка
			|ИЗ
			|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
			|ГДЕ
			|	СтруктурныеЕдиницы.ТелефонныйНомер1 = &ТелефонныйНомер1";
			
			Запрос.УстановитьПараметр("ТелефонныйНомер1", Прав(СокрЛП(НомерТелефона), 10));
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СпрОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				СпрОбъект.ОбменДанными.Загрузка = Истина;
				СпрОбъект.ТелефонныйНомер1 = "";
				СпрОбъект.Записать();
			КонецЦикла;
	КонецЕсли;

КонецПроцедуры
//---AK BARA #16739

&НаКлиенте
Процедура РедактироватьЕмейл(Команда)
	Если Элементы.СписокТелефонов.ТекущиеДанные<>Неопределено Тогда
		Если ТипЗнч(Элементы.СписокТелефонов.ТекущиеДанные.Объект)=Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Вид=ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailФизЛица");
		ИначеЕсли ТипЗнч(Элементы.СписокТелефонов.ТекущиеДанные.Объект)=Тип("СправочникСсылка.КонтактныеЛицаКонтрагентов") Тогда
			Вид=ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтактногоЛицаКонтрагента");
		ИначеЕсли ТипЗнч(Элементы.СписокТелефонов.ТекущиеДанные.Объект)=Тип("СправочникСсылка.Контрагенты") Тогда
			Вид=ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами");
		ИначеЕсли ТипЗнч(Элементы.СписокТелефонов.ТекущиеДанные.Объект)=Тип("СправочникСсылка.Организации") Тогда
			Вид=ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailОрганизации");
		Иначе
			Возврат;
		КонецЕсли; 
		
		СтруктураЗаполнения=Новый Структура("Объект, Тип,Вид",Элементы.СписокТелефонов.ТекущиеДанные.Объект,
		ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"),
		Вид);		
		ОткрытьФормуЗаписи(СтруктураЗаполнения);
		// ОБНОВИМ динамический список файлы
		Элементы.СписокТелефонов.Обновить();

		// для обновления Реквизитов
		//ЭтаФорма.Прочитать();

		// Обновление данных
		ЭтаФорма.ОбновитьОтображениеДанных();
	КонецЕсли; 
КонецПроцедуры
&НаКлиенте
Процедура ОткрытьФормуЗаписи(СтруктураЗаполнения)
	
	Если Не ЕстьЗапись(СтруктураЗаполнения) Тогда
		СтруктураДанных=Новый Структура("ЗначенияЗаполнения,ОграничитьДоступность",СтруктураЗаполнения,Истина)		
	Иначе
		ЭтотМассив=Новый Массив;
		ЭтотМассив.Добавить(СтруктураЗаполнения);
		КлючЗаписи       =    Новый("РегистрСведенийКлючЗаписи.КонтактнаяИнформация", ЭтотМассив);
		СтруктураДанных=Новый Структура("Ключ,ОграничитьДоступность",КлючЗаписи,Истина)		
	КонецЕсли;
	
	ОткрытьФормуМодально("РегистрСведений.КонтактнаяИнформация.Форма.ФормаЗаписи",СтруктураДанных,ЭтаФорма);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьЗапись(СтруктураЗаполнения)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Объект
	               |	И КонтактнаяИнформация.Тип = &Тип
	               |	И КонтактнаяИнформация.Вид = &Вид";
	
	Запрос.УстановитьПараметр("Тип", СтруктураЗаполнения.Тип);
	Запрос.УстановитьПараметр("Вид", СтруктураЗаполнения.Вид);
	Запрос.УстановитьПараметр("Объект", СтруктураЗаполнения.Объект);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		//СтруктураЗаполнения.Период=Выборка.Период;
		//СтруктураЗаполнения.Объект=Выборка.Объект;
		Возврат Истина;
	КонецЦикла;
	
	Возврат  Ложь;
КонецФункции

//+++АК PISH 2018.10.15 ИП-00019949^01
&НаКлиенте
Процедура ДобавитьЛичныйНомер(Команда)
	
	ТекущиеДанные = Элементы.СписокТелефонов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено  Тогда 
		
		ФизЛицо = ТекущиеДанные.Объект;
		
		Телефон = "";
		Если ТекущиеДанные.Вид <> "Служебный" Тогда 
			ВремТелефон  = ТекущиеДанные.НомерТелефона;
			Если Лев(ВремТелефон,1) = "8" Тогда 
				Телефон = "+7"+Сред(ВремТелефон,2);
			Иначе 
				Телефон = ВремТелефон;
			КонецЕсли;			
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура("ФизЛицо,Номер",ФизЛицо,Телефон);
		
		ОткрытьФорму("Обработка.ТелефонныйСправочник.Форма.ФормаВводаЛичногоНомера",СтруктураПараметров,ЭтаФорма);
		
	КонецЕсли;

	
КонецПроцедуры
//---АК PISH

//+++АК PISH 2018.10.15 ИП-00019949^01
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ВыбранноеЗначение = "ЗафиксироватьЛичныйНомер" Тогда 
		Элементы.СписокТелефонов.Обновить();			
	КонецЕсли;
	
КонецПроцедуры
//---АК PISH
